In [1]:
import pandas as pd
import numpy as np

In [4]:
ba = pd.read_excel("Book4.xlsx")
print(ba)

     Country    State  Literacy Rate  Salaries
0   Pakistan      KPK           78.4     50000
1      India       UP           34.5    200000
2  Australia    Wales           34.4    500000
3      China  Biejing           23.3    750000
4  NewZeland  Aukland           12.2    800500
5   Pakistan    Sindh            1.1     50000

In [15]:
ba.groupby('Literacy Rate').mean()

               Salaries
Literacy Rate
1.1               50000
12.2             800500
23.3             750000
34.4             500000
34.5             200000
78.4              50000

In [12]:
ba.groupby('Country').max()

             State  Literacy Rate  Salaries
Country
Australia    Wales           34.4    500000
China      Biejing           23.3    750000
India           UP           34.5    200000
NewZeland  Aukland           12.2    800500
Pakistan     Sindh           78.4     50000

In [11]:
ba.groupby('Salaries').min()

            Country    State  Literacy Rate
Salaries
50000      Pakistan      KPK            1.1
200000        India       UP           34.5
500000    Australia    Wales           34.4
750000        China  Biejing           23.3
800500    NewZeland  Aukland           12.2